In [1]:
import pandas as pd
from sqlalchemy import create_engine

# Conectando direto no Postgres para criar os dados
engine_pg = create_engine('postgresql://postgres:senha123@localhost:5432/postgres')

df = pd.DataFrame({
    'id': range(1, 6),
    'produto': ['Notebook', 'Mouse', 'Teclado', 'Monitor', 'Cabo HDMI'],
    'preco': [3500, 50, 150, 1200, 30]
})

df.to_sql('produtos_loja', engine_pg, if_exists='replace', index=False)
df

   id    produto  preco
0   1   Notebook   3500
1   2      Mouse     50
2   3    Teclado    150
3   4    Monitor   1200
4   5  Cabo HDMI     30

In [2]:
df = pd.DataFrame({
    'id': range(1, 6),
    'nome': ['Pietra', 'Pedro', 'Yasmin', 'Gabriel', 'Ana'],
    'cargo': ['CEO', 'Estagiario', 'Analista', 'Pleno', 'Dancarina']
})
    
df.to_sql('funcionarios', engine_pg, if_exists='replace', index=False)
df

   id     nome       cargo
0   1   Pietra         CEO
1   2    Pedro  Estagiario
2   3   Yasmin    Analista
3   4  Gabriel       Pleno
4   5      Ana   Dancarina